; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	)
(:init
	(at plane1 city3)
	(= (capacity plane1) 10565)
	(= (fuel plane1) 2756)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 9)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 7)
	(at person1 city3)
	(at person2 city6)
	(at person3 city4)
	(at person4 city2)
	(at person5 city4)
	(at person6 city2)
	(at person7 city3)
	(at person8 city6)
	(at person9 city4)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 542)
	(= (distance city0 city2) 589)
	(= (distance city0 city3) 701)
	(= (distance city0 city4) 933)
	(= (distance city0 city5) 717)
	(= (distance city0 city6) 762)
	(= (distance city1 city0) 542)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 650)
	(= (distance city1 city3) 877)
	(= (distance city1 city4) 566)
	(= (distance city1 city5) 541)
	(= (distance city1 city6) 881)
	(= (distance city2 city0) 589)
	(= (distance city2 city1) 650)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 783)
	(= (distance city2 city4) 587)
	(= (distance city2 city5) 654)
	(= (distance city2 city6) 877)
	(= (distance city3 city0) 701)
	(= (distance city3 city1) 877)
	(= (distance city3 city2) 783)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 783)
	(= (distance city3 city5) 854)
	(= (distance city3 city6) 576)
	(= (distance city4 city0) 933)
	(= (distance city4 city1) 566)
	(= (distance city4 city2) 587)
	(= (distance city4 city3) 783)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 842)
	(= (distance city4 city6) 520)
	(= (distance city5 city0) 717)
	(= (distance city5 city1) 541)
	(= (distance city5 city2) 654)
	(= (distance city5 city3) 854)
	(= (distance city5 city4) 842)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 761)
	(= (distance city6 city0) 762)
	(= (distance city6 city1) 881)
	(= (distance city6 city2) 877)
	(= (distance city6 city3) 576)
	(= (distance city6 city4) 520)
	(= (distance city6 city5) 761)
	(= (distance city6 city6) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city0)
	(at person2 city4)
	(at person3 city5)
	(at person4 city2)
	(at person5 city0)
	(at person6 city1)
	(at person7 city5)
	(at person8 city2)
	(at person9 city6)
	))

(:metric minimize (+ (* 1 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (board person1 plane1 city3)
   deleted: (at person1 city3)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 9
2. (board person7 plane1 city3)
   deleted: (at person7 city3)
   added: (in person7 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 1 of 9
3. (fly plane1 city3 city6)
   deleted: (at plane1 city3)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 0 to 2304, (fuel plane1) from 2756 to 452
   goals met: 1 of 9
4. (board person2 plane1 city6)
   deleted: (at person2 city6)
   added: (in person2 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 1 of 9
5. (board person8 plane1 city6)
   deleted: (at person8 city6)
   added: (in person8 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 1 of 9
6. (refuel plane1 city6)
   changed: (fuel plane1) from 452 to 10565
   goals met: 1 of 9
7. (fly plane1 city6 city0)
   deleted: (at plane1 city6)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 2304 to 5352, (fuel plane1) from 10565 to 7517
   goals met: 1 of 9
8. (debark person1 plane1 city0)
   deleted: (in person1 plane1)
   added: (at person1 city0)
   changed: (onboard plane1) from 4 to 3
   goals met: 2 of 9
9. (fly plane1 city0 city4)
   deleted: (at plane1 city0)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 5352 to 9084, (fuel plane1) from 7517 to 3785
   goals met: 2 of 9
10. (debark person2 plane1 city4)
   deleted: (in person2 plane1)
   added: (at person2 city4)
   changed: (onboard plane1) from 3 to 2
   goals met: 3 of 9
11. (board person3 plane1 city4)
   deleted: (at person3 city4)
   added: (in person3 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 3 of 9
12. (board person5 plane1 city4)
   deleted: (at person5 city4)
   added: (in person5 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 3 of 9
13. (board person9 plane1 city4)
   deleted: (at person9 city4)
   added: (in person9 plane1)
   changed: (onboard plane1) from 4 to 5
   goals met: 3 of 9
14. (fly plane1 city4 city5)
   deleted: (at plane1 city4)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 9084 to 12452, (fuel plane1) from 3785 to 417
   goals met: 3 of 9
15. (debark person3 plane1 city5)
   deleted: (in person3 plane1)
   added: (at person3 city5)
   changed: (onboard plane1) from 5 to 4
   goals met: 4 of 9
16. (debark person7 plane1 city5)
   deleted: (in person7 plane1)
   added: (at person7 city5)
   changed: (onboard plane1) from 4 to 3
   goals met: 5 of 9
17. (refuel plane1 city5)
   changed: (fuel plane1) from 417 to 10565
   goals met: 5 of 9
18. (fly plane1 city5 city0)
   deleted: (at plane1 city5)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 12452 to 15320, (fuel plane1) from 10565 to 7697
   goals met: 5 of 9
19. (debark person5 plane1 city0)
   deleted: (in person5 plane1)
   added: (at person5 city0)
   changed: (onboard plane1) from 3 to 2
   goals met: 6 of 9
20. (fly plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 15320 to 17676, (fuel plane1) from 7697 to 5341
   goals met: 6 of 9
21. (debark person8 plane1 city2)
   deleted: (in person8 plane1)
   added: (at person8 city2)
   changed: (onboard plane1) from 2 to 1
   goals met: 7 of 9
22. (board person6 plane1 city2)
   deleted: (at person6 city2)
   added: (in person6 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 7 of 9
23. (fly plane1 city2 city6)
   deleted: (at plane1 city2)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 17676 to 21184, (fuel plane1) from 5341 to 1833
   goals met: 7 of 9
24. (debark person9 plane1 city6)
   deleted: (in person9 plane1)
   added: (at person9 city6)
   changed: (onboard plane1) from 2 to 1
   goals met: 8 of 9
25. (refuel plane1 city6)
   changed: (fuel plane1) from 1833 to 10565
   goals met: 8 of 9
26. (fly plane1 city6 city1)
   deleted: (at plane1 city6)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 21184 to 24708, (fuel plane1) from 10565 to 7041
   goals met: 8 of 9
27. (debark person6 plane1 city1)
   deleted: (in person6 plane1)
   added: (at person6 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 9 of 9
